app/Controllers/Contas.php

SELECT `contas`.*, `usuarios`.`nome`, `usuarios`.`email`, `usuarios`.`tipoUsuario`
FROM `contas`
JOIN `usuarios` ON `usuarios`.`id` = `contas`.`idUsuario`
---
    public function index()
    {
        $contas = new ContasModel();
        $contas = $contas->select('contas.*, usuarios.nome, usuarios.email, usuarios.tipoUsuario')
            ->join('usuarios', 'usuarios.id = contas.idUsuario')
            ->findAll();

SELECT `contas`.`id`, `usuarios`.`id` as `usuarioId`, `usuarios`.`nome`, `contas`.`saldo`
FROM `contas`
JOIN `usuarios` ON `usuarios`.`id` = `contas`.`idUsuario`
WHERE `idUsuario` = 2
 LIMIT 1
---
    public function getContaUsuario(int $userId)
    {
        $contas = new ContasModel();
        $conta = $contas->select('contas.id, usuarios.id as usuarioId, usuarios.nome, contas.saldo')
            ->join('usuarios', 'usuarios.id = contas.idUsuario')
            ->where('idUsuario', $userId)
            ->first();