app/Controllers/Transacoes.php

            ];

            // VALIDAR TRANSACOES COM AS REGRAS
            $saldo = $contas->select('*, contas.saldo')
                            ->join('usuarios u', 'u.id = contas.idUsuario')
                            ->where('contas.id', $de)
                            ->first();
            $destino = $contas->where('id', $para)->first();
---
SELECT *, `contas`.`saldo`
FROM `contas`
JOIN `usuarios` `u` ON `u`.`id` = `contas`.`idUsuario`
WHERE `contas`.`id` = 1
 LIMIT 1
SELECT *
FROM `contas`
WHERE `id` = 2
 LIMIT 1