app/Models/TransacoesModel.php

INSERT INTO `transacoes` (`de`, `para`, `valor`, `status`, `notification_sent`) VALUES (1, 2, 500, 'pending', 0)
---
    public function criarTransacao(array $data): int
    {
        $data['status'] = self::STATUS_PENDING;
        $data['notification_sent'] = false;
        return $this->insert($data);

UPDATE `contas` SET `saldo` = saldo - 500
WHERE `id` = 1
UPDATE `contas` SET `saldo` = saldo + 500
WHERE `id` = 2
---
    public function transferirSaldo($de, $para, $valor)
    {
        $contasModel = new \App\Models\ContasModel();
        $db = \Config\Database::connect();

        try {
            $db->transStart();

            // REMOVE SALDO from source account
            $contasModel->where('id', $de)
                       ->set('saldo', 'saldo - ' . $valor, false)
                       ->update();

            // ADD SALDO to destination account
            $contasModel->where('id', $para)
                       ->set('saldo', 'saldo + ' . $valor, false)
                       ->update();

UPDATE `transacoes` SET `status` = 'completed', `completed_at` = '2026-01-18 22:30:23', `authorization_code` = '696d5eff0928f'
WHERE `transacoes`.`id` IN (72)
---
    public function markAsCompleted(int $idTransacao, ?string $authCode = null): bool
    {
        $data = [
            'status' => self::STATUS_COMPLETED,
            'completed_at' => date('Y-m-d H:i:s')
        ];

        if ($authCode) {
            $data['authorization_code'] = $authCode;
        }

        return $this->update($idTransacao, $data);